In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("titanic.csv")

In [15]:
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [17]:
df.isnull().sum()

Survived                   0
Pclass                     0
Name                       0
Sex                        0
Age                        0
Siblings/Spouses Aboard    0
Parents/Children Aboard    0
Fare                       0
dtype: int64

In [ ]:
df = df.drop("level_0", axis=1)

In [48]:
df["Siblings/Spouses"] = df["Siblings/Spouses Aboard"]

In [49]:
df["Parents/Children"] = df["Parents/Children Aboard"]

In [52]:
df = df.drop(["Parents/Children Aboard","Siblings/Spouses Aboard"], axis=1)

In [53]:
df.head(5)

,index,Survived,Pclass,Name,Sex,Age,Fare,Siblings/Spouses,Parents/Children
0,0,0,3,Mr. Owen Harris Braund,male,22.0,7.2500,1,0
1,1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,71.2833,1,0
2,2,1,3,Miss. Laina Heikkinen,female,26.0,7.9250,0,0
3,3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,53.1000,1,0
4,4,0,3,Mr. William Henry Allen,male,35.0,8.0500,0,0

In [42]:
#Retreive length of each column 

measurer = np.vectorize(len)
measurer(df.values.astype(str)).max(axis=0)

array([ 3,  1,  1, 81,  6,  4,  1,  1,  8])

In [54]:
import sqlite3

In [55]:
conn = sqlite3.connect('titanic.sqlite3')

In [56]:
df.to_sql("titanic4",con=conn)

In [57]:
conn.execute("SELECT name FROM titanic4 LIMIT 10;").fetchall()

[('Mr. Owen Harris Braund',),
 ('Mrs. John Bradley (Florence Briggs Thayer) Cumings',),
 ('Miss. Laina Heikkinen',),
 ('Mrs. Jacques Heath (Lily May Peel) Futrelle',),
 ('Mr. William Henry Allen',),
 ('Mr. James Moran',),
 ('Mr. Timothy J McCarthy',),
 ('Master. Gosta Leonard Palsson',),
 ('Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson',),
 ('Mrs. Nicholas (Adele Achem) Nasser',)]

# Postgress Db Setup

In [58]:
import psycopg2
from creds import Elephant

In [64]:
dbname = Elephant.dbname #same as user
user = Elephant.user #same as dbname
password = Elephant.password #don't commit this to github!
host = Elephant.host #from SERVER type this in as string

pg_conn = psycopg2.connect(dbname=dbname, user=user, password=password, host=host)
pg_conn
pg_curs = pg_conn.cursor()
pg_curs.execute('SELECT * FROM test_table;')
pg_curs.fetchall()

[(2, 'a second row', {'a': 1, 'b': ['dog', 'cat', 42], 'c': True})]

In [62]:
create_titanic_table = """
  CREATE TABLE titanic (
    index SERIAL PRIMARY KEY,
    Survived BOOL,
    Pclass INT,
    Name VARCHAR(81),
    Sex VARCHAR(6),
    Age FLOAT,
    Fare FLOAT,
    Siblings/Spouses BOOL,
    Parents/Children INT
  );
"""

In [65]:
pg_curs.execute(create_titanic_table)

SyntaxError: syntax error at or near "/"
LINE 10:     Siblings/Spouses BOOL,
                     ^